# DividedSurfaceInvalidSpacing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedSurfaceFailures..::..DividedSurfaceInvalidSpacing Property
BuiltInFailures..::..DividedSurfaceFailures Class See Also
---
Constraints not satisfied, cannot generate gridlines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedSurfaceInvalidSpacing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceInvalidSpacing As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedSurfaceInvalidSpacing {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace